user_id is the primary key (column with unique values) for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.

Write a solution to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

In [1]:
import pandas as pd

In [5]:
def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.capitalize()

    return users.sort_values(by='user_id')

In [6]:
df = pd.read_csv('Users.csv', header=0)
df

   user_id    name
0        1   aLice
1        2     bOB
2        3   kAbiR
3        6   emeKA
4       90  MarYam

In [7]:
fix_names(df)

   user_id    name
0        1   Alice
1        2     Bob
2        3   Kabir
3        6   Emeka
4       90  Maryam